Action Pack/app/controllers/todo_items_controller.rb

  def index
    @todo_items = TodoItem.all
---
SELECT "todo_items".* FROM "todo_items"

  def create
    @todo_item = TodoItem.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save
---
INSERT INTO "todo_items" ("title", "description", "completed", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Random"], ["description", ""], ["completed", "f"], ["due_date", "2020-11-22"], ["created_at", "2020-11-22 11:42:42.198024"], ["updated_at", "2020-11-22 11:42:42.198024"]]